// ========= footer ==============================================================================================================================
// footer
Vue.component('footer-logo', {
    data: function(){
        return {
            name: '富蘭克林證券投顧',
        }
    },
    template: `<div class="footer-logo">
                    <a href="http://www.franklin.com.tw/" target="_blank" :title="name">
                        <img src="images/footer-logo-1.png" :alt="name">
                        <strong>{{name}}</strong>
                    </a>
                </div>`,
});

Vue.component('footer-contact',{
    data: function(){
        return {
            phoneTit: '國民理財專線',
        }
    },
    template: `<div class="footer-contact">
                    <div class="footer-contact-tel">
                        <strong>{{ phoneTit }}：</strong>
                        <a href="tel:0800-885-888" :title="phoneTit">
                            <strong>0800-885-888</strong>
                        </a>
                    </div>
                    <ul class="footer-contact-link">
                        <li>
                            <a href="https://www.facebook.com/franklin.taiwan/" target="_blank" title="粉絲團">
                                <img src="images/icon-fb.png" alt="">
                            </a>
                        </li>
                        <li>
                            <a href="http://line.naver.jp/ti/p/%40franklin" target="_blank" title="Line">
                                <img src="images/icon-line.png" alt="">
                            </a>
                        </li>
                        <li>
                            <a href="https://www.youtube.com/user/franklin0800885888" target="_blank" title="youtube">
                                <img src="images/icon-youtube.png" alt="">
                            </a>
                        </li>
                    </ul>
                </div>`,
});

Vue.component('footer-warning',{
    data: function(){
        return {
            list: [
                {
                    id: 0,
                    info: '本公司所提供之資訊，僅供接收人之參考用途。本公司當盡力提供正確之資訊，所載資料均來自或本諸我們相信可靠之來源，但對其完整性、即時性和正確性不做任何擔保，如有錯漏或疏忽，本公司或關係企業與其任何董事或受僱人，並不負任何法律責任。任何人因信賴此等資料而做出或改變投資決策，須自行承擔結果。本網頁所載資料或任何部份均不可以進行抄錄、翻印或另作派發。'
                },
                {
                    id: 1,
                    info: '本境外基金經金融監督管理委員會核准或申報生效在國內募集及銷售，惟不表示絕無風險。基金經理公司以往之經理績效不保證基金之最低投資收益；基金經理公司除盡善良管理人之注意義務外，不負責本基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱基金公開說明書。'
                },
                {
                    id: 2,
                    info: '<span class="footer-warning-focus">由於高收益債券之信用評等未達投資等級或未經信用評等，且對利率變動的敏感度甚高，故本基金可能會因利率上升、市場流動性下降，或債券發行機構違約不支付本金、利息或破產而蒙受虧損。本基金不適合無法承擔相關風險之投資人。基金經理公司以往之經理績效不保證基金之最低投資收益；基金經理公司除盡善良管理人之注意義務外，不負責本基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱基金公開說明書。本基金較適合投資屬性中風險承受度較高之投資人，投資人投資高收益債券為訴求基金不宜占其投資組合過高之比重，投資人應審慎評估。</span>'
                },
                {
                    id: 3,
                    info: '由於新興市場基金之主要投資風險除包含一般股票型基金之投資組合跌價與匯率風險外，與成熟市場相比須承受較高之政治與金融管理風險，而因市值及制度性因素，流動性風險也相對較高，新興市場投資組合波動性普遍高於成熟市場。基金投資均涉及風險且不負任何抵抗投資虧損之擔保。投資風險之詳細資料請參閱基金公開說明書。'
                },
                {
                    id: 4,
                    info: '<span class="footer-warning-focus">境外基金投資大陸地區證券市場之有價證券以掛牌上市有價證券為限，且投資前述有價證券總金額不得超過本基金淨資產價值之20%，另投資香港地區紅籌股及H股並無限制。本基金並非完全投資於大陸地區之有價證券，投資人仍須留意中國市場特定政治、經濟與市場之投資風險。</span>'
                },
                {
                    id: 5,
                    info: '基金的配息可能由基金的收益或本金中支付。部分基金進行配息前未先扣除應負擔之費用。任何涉及由本金支出的部份，可能導致原始投資金額減損。由本金支付配息之相關資料已揭露於本公司網站，投資人可至本公司網站(<a href="https://www.Franklin.com.tw" target="_blank">https://www.Franklin.com.tw</a>)查閱。'
                },
                {
                    id: 6,
                    info: `投資基金所應承擔之相關風險及應負擔之費用(含分銷費用)已揭露於基金公開說明書及投資人須知中，投資人可至境外基金資訊觀測站(<a href="https://www.fundclear.com.tw/" target="_blank">https://www.fundclear.com.tw/</a>)下載，或逕向本公司網站(<a href="https://www.franklin.com.tw/" target="_blank">https://www.franklin.com.tw/</a>)查閱。
                            <div class="footer-warning-remark">【富蘭克林證券投顧獨立經營管理】</div>`
                },
            ]
        }
    },
    template: `<div class="footer-warning">
                    <ul>
                        <li v-for="item in list" v-bind:key="item.id" v-html="item.info"></li>
                    </ul>
                </div>`,
});

Vue.component('footer-area',{
    template: `<footer>
                    <div class="container">
                        <div class="clearfix">
                            <footer-logo></footer-logo>
                            <footer-contact></footer-contact>
                        </div>
                        <div class="copyright">
                            富蘭克林證券投資顧問(股)公司 ｜ 台北市忠孝東路四段87號8樓 ｜ 101年金管投顧新字第025號 ｜ 版權所有富蘭克林證券投顧 FRANKLIN TEMPLETON INVESTMENTS
                        </div>
                        <div class="footer-line"></div>
                        <footer-warning></footer-warning>
                    </div>
                </footer>`,
});

// ========= header-logo ==============================================================================================================================
Vue.component('header-logo', {
    template: ` <svg version="1.1" x="0px" y="0px" viewBox="0 0 303 145" style="enable-background:new 0 0 303 145;" xml:space="preserve">
                    <g>
                        <path class="st0" d="M11.2,107c-0.26-0.99-0.49-1.66-0.91-2.16c-0.49-0.62-1.14-0.83-2.81-0.83H5.95c-0.86,0-0.96,0.05-0.96,0.88
                        v5.9h2.34c2.31,0,2.52-0.23,2.83-1.9h0.86v5.1h-0.86c-0.29-1.74-0.52-2-2.83-2H4.99v4.34c0,2.37,0.21,2.52,2.52,2.71v0.83h-7.72
                        v-0.83c1.95-0.18,2.18-0.34,2.18-2.71v-9.88c0-2.31-0.23-2.47-2.16-2.63v-0.86H11.8c0,0.62,0.13,2.47,0.26,3.9L11.2,107z
                        M30.7,120.1c-0.21,0-0.49-0.03-0.81-0.03c-2.81-0.13-3.82-0.8-4.94-2.47c-0.75-1.14-1.53-2.63-2.29-3.95
                        c-0.44-0.75-0.88-1.09-1.92-1.09h-0.6v3.93c0,2.16,0.23,2.37,2.24,2.55v0.83h-7.46v-0.83c2-0.18,2.26-0.39,2.26-2.55v-10.17
                        c0-2.13-0.23-2.34-2.16-2.52v-0.83h6.97c2.16,0,3.46,0.23,4.47,0.94c1.04,0.7,1.74,1.85,1.74,3.46c0,2.26-1.46,3.56-3.28,4.32
                        c0.42,0.81,1.43,2.52,2.21,3.72c0.91,1.4,1.46,2.18,2.03,2.78c0.6,0.65,1.09,0.96,1.69,1.14L30.7,120.1z M21.03,111.6
                        c1.17,0,2.03-0.18,2.65-0.7c0.91-0.75,1.3-1.79,1.3-3.15c0-2.81-1.69-3.82-3.33-3.82c-0.7,0-1.09,0.1-1.27,0.26
                        c-0.18,0.16-0.23,0.44-0.23,1.04v6.37H21.03z M42.11,119.87v-0.83c1.56-0.23,1.74-0.52,1.35-1.61c-0.29-0.86-0.73-2.08-1.2-3.33
                        h-5.17c-0.34,0.94-0.7,1.95-1.01,2.99c-0.44,1.4-0.31,1.72,1.59,1.95v0.83h-5.75v-0.83c1.69-0.21,2.03-0.47,2.91-2.71l5.36-13.44
                        l1.14-0.31c1.64,4.52,3.28,9.21,4.97,13.68c0.86,2.29,1.2,2.6,2.86,2.78v0.83H42.11z M39.77,106.84h-0.05
                        c-0.78,2-1.48,4.03-2.21,5.98h4.34L39.77,106.84z M69.43,103.8c-1.4,0.08-1.97,0.42-2.11,1.59c-0.1,0.8-0.21,2-0.21,4.34v10.4
                        h-1.09L55.1,106.92h-0.05V113c0,2.34,0.11,3.51,0.18,4.29c0.13,1.22,0.65,1.64,2.5,1.74v0.83h-6.27v-0.83
                        c1.46-0.1,2.08-0.49,2.18-1.66c0.1-0.86,0.23-2.03,0.23-4.37v-5.51c0-1.8-0.05-2.13-0.52-2.73c-0.52-0.65-1.09-0.86-2.24-0.96
                        v-0.83h4.45l10.27,12.01h0.08v-5.25c0-2.31-0.13-3.54-0.18-4.29c-0.13-1.14-0.7-1.53-2.57-1.64v-0.83h6.27V103.8z M84.08,119.87
                        c-1.43-1.79-3.59-4.65-5.59-7.38c-0.57-0.75-0.91-0.88-1.33-0.83v4.79c0,2.23,0.23,2.42,2.29,2.6v0.83h-7.41v-0.83
                        c1.92-0.18,2.16-0.37,2.16-2.6V106.4c0-2.26-0.24-2.42-2.24-2.6v-0.83h7.33v0.83c-1.92,0.18-2.13,0.34-2.13,2.6v4.47
                        c0.55-0.16,1.14-0.55,1.92-1.3c1.64-1.61,2.94-3.09,3.9-4.37c0.68-0.83,0.63-1.17-0.57-1.33l-0.52-0.08v-0.83h6.58v0.83
                        c-1.74,0.18-2.65,0.47-4.16,1.87c-1.33,1.25-2.7,2.68-4.08,4.11c1.77,2.5,4.03,5.33,5.7,7.33c1.2,1.4,1.82,1.77,2.94,1.92v0.83
                        H84.08z M104.05,115.58c-0.21,1.01-0.73,3.56-0.96,4.29H90.76v-0.83c2.24-0.18,2.47-0.34,2.47-2.55v-10.14
                        c0-2.21-0.21-2.37-2.26-2.55v-0.83h7.52v0.83c-2,0.18-2.24,0.31-2.24,2.55v10.22c0,1.27,0.1,1.77,0.62,2
                        c0.47,0.21,1.22,0.26,2.13,0.26c1.25,0,2.16-0.16,2.76-0.86c0.49-0.52,0.96-1.35,1.4-2.63L104.05,115.58z M106.23,119.87v-0.83
                        c2-0.18,2.23-0.34,2.23-2.55v-10.14c0-2.21-0.23-2.37-2.23-2.55v-0.83h7.46v0.83c-2,0.18-2.21,0.34-2.21,2.55v10.14
                        c0,2.21,0.21,2.37,2.21,2.55v0.83H106.23z M134.51,103.8c-1.4,0.08-1.98,0.42-2.11,1.59c-0.1,0.8-0.21,2-0.21,4.34v10.4h-1.09
                        l-10.92-13.21h-0.05V113c0,2.34,0.1,3.51,0.18,4.29c0.13,1.22,0.65,1.64,2.5,1.74v0.83h-6.27v-0.83c1.46-0.1,2.08-0.49,2.18-1.66
                        c0.1-0.86,0.23-2.03,0.23-4.37v-5.51c0-1.8-0.05-2.13-0.52-2.73c-0.52-0.65-1.09-0.86-2.23-0.96v-0.83h4.45l10.27,12.01h0.08v-5.25
                        c0-2.31-0.13-3.54-0.18-4.29c-0.13-1.14-0.7-1.53-2.57-1.64v-0.83h6.27V103.8z M157.76,107.26c-0.31-1.3-0.62-2.11-1.04-2.55
                        c-0.44-0.52-1.01-0.7-2.71-0.7h-1.4v12.51c0,2.13,0.23,2.34,2.6,2.52v0.83h-8.11v-0.83c2.26-0.18,2.5-0.37,2.5-2.52v-12.51h-1.14
                        c-2.16,0-2.65,0.26-3.02,0.75c-0.39,0.44-0.68,1.28-0.99,2.52h-0.88c0.1-1.79,0.26-3.62,0.31-4.97h0.6
                        c0.39,0.6,0.73,0.65,1.46,0.65h10.4c0.68,0,0.99-0.16,1.43-0.65h0.6c0,1.12,0.13,3.28,0.26,4.89L157.76,107.26z M174.92,115.63
                        c-0.16,1.07-0.68,3.46-0.91,4.24h-13v-0.83c2.26-0.18,2.5-0.37,2.5-2.55v-10.11c0-2.29-0.23-2.42-2.16-2.57v-0.83h12.01
                        c0.03,0.52,0.16,2.31,0.26,3.85l-0.88,0.13c-0.23-0.99-0.55-1.74-0.96-2.23c-0.42-0.52-1.12-0.7-2.73-0.7h-1.53
                        c-0.91,0-0.99,0.05-0.99,0.88v5.69h2c2.29,0,2.55-0.16,2.89-1.98h0.86v5.15h-0.86c-0.34-1.85-0.63-1.97-2.86-1.97h-2.03v4.63
                        c0,1.25,0.13,1.87,0.63,2.13c0.49,0.26,1.4,0.29,2.5,0.29c1.59,0,2.42-0.18,3.02-0.86c0.49-0.55,0.96-1.4,1.4-2.5L174.92,115.63z
                        M191.33,119.87v-0.83c2-0.21,2.13-0.39,2.11-2.91l-0.05-10.22h-0.13l-5.95,13.78h-0.65l-5.49-13.5h-0.1l-0.34,7.02
                        c-0.11,2.16-0.11,3.33-0.03,4.24c0.08,1.2,0.63,1.4,2.37,1.56v0.86h-6.19v-0.86c1.48-0.13,1.98-0.54,2.16-1.51
                        c0.16-0.86,0.34-2.13,0.52-4.86l0.39-5.23c0.23-3.12,0.05-3.41-2.21-3.61v-0.83h4.96l5.33,11.96l5.44-11.96h4.94v0.83
                        c-2.16,0.21-2.26,0.36-2.21,2.7l0.23,9.62c0.08,2.52,0.18,2.7,2.29,2.91v0.83H191.33z M208.51,102.97c1.98,0,3.46,0.29,4.5,1.01
                        c1.14,0.83,1.85,2.08,1.85,3.79c0,3.43-2.57,5.04-5.25,5.36c-0.39,0.05-0.8,0.05-1.12,0.05l-1.82-0.47v3.77
                        c0,2.21,0.23,2.37,2.5,2.55v0.83h-7.72v-0.83c2-0.18,2.24-0.37,2.24-2.55v-10.14c0-2.24-0.23-2.37-2.08-2.55v-0.83H208.51z
                        M206.67,111.75c0.31,0.16,0.91,0.29,1.59,0.29c1.22,0,3.3-0.75,3.3-4.19c0-2.91-1.72-3.95-3.48-3.95c-0.6,0-0.99,0.13-1.14,0.29
                        c-0.18,0.16-0.26,0.44-0.26,0.96V111.75z M230.66,115.58c-0.21,1.01-0.73,3.56-0.96,4.29h-12.32v-0.83
                        c2.24-0.18,2.47-0.34,2.47-2.55v-10.14c0-2.21-0.21-2.37-2.26-2.55v-0.83h7.52v0.83c-2,0.18-2.24,0.31-2.24,2.55v10.22
                        c0,1.27,0.1,1.77,0.62,2c0.47,0.21,1.22,0.26,2.13,0.26c1.25,0,2.16-0.16,2.76-0.86c0.49-0.52,0.96-1.35,1.4-2.63L230.66,115.58z
                        M246.47,115.63c-0.16,1.07-0.68,3.46-0.91,4.24h-13v-0.83c2.26-0.18,2.5-0.37,2.5-2.55v-10.11c0-2.29-0.23-2.42-2.16-2.57v-0.83
                        h12.01c0.03,0.52,0.16,2.31,0.26,3.85l-0.88,0.13c-0.23-0.99-0.55-1.74-0.96-2.23c-0.42-0.52-1.12-0.7-2.73-0.7h-1.53
                        c-0.91,0-0.99,0.05-0.99,0.88v5.69h2c2.29,0,2.55-0.16,2.89-1.98h0.86v5.15h-0.86c-0.34-1.85-0.63-1.97-2.86-1.97h-2.03v4.63
                        c0,1.25,0.13,1.87,0.62,2.13c0.49,0.26,1.4,0.29,2.5,0.29c1.59,0,2.42-0.18,3.02-0.86c0.49-0.55,0.96-1.4,1.4-2.5L246.47,115.63z
                        M262.67,107.26c-0.31-1.3-0.63-2.11-1.04-2.55c-0.44-0.52-1.01-0.7-2.7-0.7h-1.4v12.51c0,2.13,0.23,2.34,2.6,2.52v0.83h-8.11
                        v-0.83c2.26-0.18,2.5-0.37,2.5-2.52v-12.51h-1.14c-2.16,0-2.65,0.26-3.02,0.75c-0.39,0.44-0.68,1.28-0.99,2.52h-0.88
                        c0.1-1.79,0.26-3.62,0.31-4.97h0.6c0.39,0.6,0.73,0.65,1.46,0.65h10.4c0.68,0,0.99-0.16,1.43-0.65h0.6c0,1.12,0.13,3.28,0.26,4.89
                        L262.67,107.26z M282.9,111.23c0,5.62-4,9.02-8.84,9.02c-5.02,0-8.68-3.74-8.68-8.74c0-4.55,3.22-8.92,9-8.92
                        C279,102.6,282.9,106.09,282.9,111.23z M268.88,110.92c0,4.6,2.21,8.29,5.67,8.29c2.63,0,4.84-2.42,4.84-7.25
                        c0-5.3-2.37-8.32-5.54-8.32C271.15,103.64,268.88,106.29,268.88,110.92z M303,103.8c-1.4,0.08-1.97,0.42-2.11,1.59
                        c-0.1,0.8-0.21,2-0.21,4.34v10.4h-1.09l-10.92-13.21h-0.05V113c0,2.34,0.1,3.51,0.18,4.29c0.13,1.22,0.65,1.64,2.5,1.74v0.83h-6.27
                        v-0.83c1.46-0.1,2.08-0.49,2.19-1.66c0.1-0.86,0.23-2.03,0.23-4.37v-5.51c0-1.8-0.05-2.13-0.52-2.73
                        c-0.52-0.65-1.09-0.86-2.24-0.96v-0.83h4.45l10.27,12.01h0.08v-5.25c0-2.31-0.13-3.54-0.18-4.29c-0.13-1.14-0.7-1.53-2.57-1.64
                        v-0.83H303V103.8z M59.47,145.13v-0.83c2-0.18,2.24-0.34,2.24-2.55v-10.14c0-2.21-0.23-2.37-2.24-2.55v-0.83h7.46v0.83
                        c-2,0.18-2.21,0.34-2.21,2.55v10.14c0,2.21,0.21,2.37,2.21,2.55v0.83H59.47z M87.73,129.06c-1.4,0.08-1.98,0.42-2.11,1.59
                        c-0.1,0.8-0.21,2-0.21,4.34v10.4h-1.09L73.4,132.18h-0.05v6.08c0,2.34,0.1,3.51,0.18,4.29c0.13,1.22,0.65,1.64,2.5,1.74v0.83h-6.27
                        v-0.83c1.46-0.1,2.08-0.49,2.18-1.66c0.1-0.86,0.23-2.03,0.23-4.37v-5.51c0-1.79-0.05-2.13-0.52-2.73
                        c-0.52-0.65-1.09-0.86-2.23-0.96v-0.83h4.45l10.27,12.01h0.08v-5.25c0-2.31-0.13-3.54-0.18-4.29c-0.13-1.14-0.7-1.53-2.57-1.64
                        v-0.83h6.27V129.06z M106.37,129.08c-1.71,0.18-2.13,0.47-3.17,2.91c-0.78,1.9-3.3,8.06-5.3,13.42h-1.12
                        c-1.77-4.76-4.08-10.79-5.33-13.88c-0.78-1.97-1.2-2.29-2.78-2.44v-0.86h7.26v0.86c-1.87,0.23-1.9,0.49-1.51,1.64
                        c0.73,2,2.71,7.18,3.95,10.35h0.08c1.38-3.59,2.81-7.33,3.56-9.72c0.54-1.69,0.49-2-1.64-2.26v-0.86h6.01V129.08z M121.53,140.89
                        c-0.16,1.07-0.68,3.46-0.91,4.24h-13v-0.83c2.26-0.18,2.5-0.37,2.5-2.55v-10.11c0-2.29-0.23-2.42-2.16-2.57v-0.83h12.01
                        c0.03,0.52,0.16,2.31,0.26,3.85l-0.88,0.13c-0.23-0.99-0.54-1.74-0.96-2.23c-0.42-0.52-1.12-0.7-2.73-0.7h-1.53
                        c-0.91,0-0.99,0.05-0.99,0.88v5.69h2c2.29,0,2.55-0.16,2.89-1.98h0.86v5.15h-0.86c-0.34-1.85-0.63-1.97-2.86-1.97h-2.03v4.63
                        c0,1.25,0.13,1.87,0.62,2.13c0.49,0.26,1.4,0.29,2.5,0.29c1.59,0,2.42-0.18,3.02-0.86c0.49-0.55,0.96-1.4,1.4-2.5L121.53,140.89z
                        M133.28,132.33c-0.49-1.64-1.38-3.51-3.54-3.51c-1.66,0-2.68,1.2-2.68,2.65c0,1.61,1.07,2.47,3.28,3.59
                        c2.47,1.22,4.55,2.6,4.55,5.3c0,2.88-2.45,5.15-6.14,5.15c-0.99,0-1.87-0.15-2.57-0.36c-0.7-0.23-1.17-0.42-1.48-0.57
                        c-0.23-0.62-0.57-2.81-0.75-4.26l0.88-0.26c0.47,1.64,1.87,4.45,4.42,4.45c1.74,0,2.81-1.14,2.81-2.88c0-1.66-1.25-2.63-3.2-3.67
                        c-2.31-1.17-4.45-2.55-4.45-5.2c0-2.73,2.16-4.91,5.75-4.91c1.48,0,2.83,0.42,3.48,0.65c0.1,0.94,0.26,2.03,0.49,3.67
                        L133.28,132.33z M151.49,132.52c-0.31-1.3-0.63-2.11-1.04-2.55c-0.44-0.52-1.01-0.7-2.7-0.7h-1.4v12.51c0,2.13,0.23,2.34,2.6,2.52
                        v0.83h-8.11v-0.83c2.26-0.18,2.5-0.37,2.5-2.52v-12.51h-1.14c-2.16,0-2.65,0.26-3.02,0.75c-0.39,0.44-0.68,1.28-0.99,2.52h-0.88
                        c0.1-1.79,0.26-3.62,0.31-4.97h0.6c0.39,0.6,0.73,0.65,1.46,0.65h10.4c0.68,0,0.99-0.16,1.43-0.65h0.6c0,1.12,0.13,3.28,0.26,4.89
                        L151.49,132.52z M168.83,145.13v-0.83c2-0.21,2.13-0.39,2.11-2.91l-0.05-10.22h-0.13l-5.95,13.78h-0.65l-5.49-13.5h-0.1l-0.34,7.02
                        c-0.1,2.16-0.1,3.33-0.03,4.24c0.08,1.2,0.62,1.4,2.37,1.56v0.86h-6.19v-0.86c1.48-0.13,1.97-0.54,2.16-1.51
                        c0.15-0.86,0.34-2.13,0.52-4.86l0.39-5.23c0.23-3.12,0.05-3.41-2.21-3.61v-0.83h4.97l5.33,11.96l5.43-11.96h4.94v0.83
                        c-2.16,0.21-2.26,0.36-2.21,2.7l0.23,9.62c0.08,2.52,0.18,2.7,2.29,2.91v0.83H168.83z M192.6,140.89
                        c-0.16,1.07-0.68,3.46-0.91,4.24h-13v-0.83c2.26-0.18,2.5-0.37,2.5-2.55v-10.11c0-2.29-0.23-2.42-2.16-2.57v-0.83h12.01
                        c0.03,0.52,0.16,2.31,0.26,3.85l-0.88,0.13c-0.23-0.99-0.55-1.74-0.96-2.23c-0.42-0.52-1.12-0.7-2.73-0.7h-1.53
                        c-0.91,0-0.99,0.05-0.99,0.88v5.69h2c2.29,0,2.55-0.16,2.89-1.98h0.86v5.15h-0.86c-0.34-1.85-0.63-1.97-2.86-1.97h-2.03v4.63
                        c0,1.25,0.13,1.87,0.62,2.13c0.49,0.26,1.4,0.29,2.5,0.29c1.59,0,2.42-0.18,3.02-0.86c0.49-0.55,0.96-1.4,1.4-2.5L192.6,140.89z
                        M212.75,129.06c-1.4,0.08-1.98,0.42-2.11,1.59c-0.11,0.8-0.21,2-0.21,4.34v10.4h-1.09l-10.92-13.21h-0.05v6.08
                        c0,2.34,0.1,3.51,0.18,4.29c0.13,1.22,0.65,1.64,2.5,1.74v0.83h-6.27v-0.83c1.46-0.1,2.08-0.49,2.18-1.66
                        c0.1-0.86,0.23-2.03,0.23-4.37v-5.51c0-1.79-0.05-2.13-0.52-2.73c-0.52-0.65-1.09-0.86-2.24-0.96v-0.83h4.45l10.27,12.01h0.08
                        v-5.25c0-2.31-0.13-3.54-0.18-4.29c-0.13-1.14-0.7-1.53-2.57-1.64v-0.83h6.27V129.06z M229.22,132.52
                        c-0.31-1.3-0.63-2.11-1.04-2.55c-0.44-0.52-1.01-0.7-2.7-0.7h-1.4v12.51c0,2.13,0.23,2.34,2.6,2.52v0.83h-8.11v-0.83
                        c2.26-0.18,2.5-0.37,2.5-2.52v-12.51h-1.14c-2.16,0-2.65,0.26-3.02,0.75c-0.39,0.44-0.68,1.28-0.99,2.52h-0.88
                        c0.1-1.79,0.26-3.62,0.31-4.97h0.6c0.39,0.6,0.73,0.65,1.46,0.65h10.4c0.68,0,0.99-0.16,1.43-0.65h0.6c0,1.12,0.13,3.28,0.26,4.89
                        L229.22,132.52z M241.31,132.33c-0.49-1.64-1.38-3.51-3.54-3.51c-1.66,0-2.68,1.2-2.68,2.65c0,1.61,1.07,2.47,3.28,3.59
                        c2.47,1.22,4.55,2.6,4.55,5.3c0,2.88-2.44,5.15-6.13,5.15c-0.99,0-1.87-0.15-2.57-0.36c-0.7-0.23-1.17-0.42-1.48-0.57
                        c-0.23-0.62-0.57-2.81-0.75-4.26l0.88-0.26c0.47,1.64,1.87,4.45,4.42,4.45c1.74,0,2.81-1.14,2.81-2.88c0-1.66-1.25-2.63-3.2-3.67
                        c-2.31-1.17-4.45-2.55-4.45-5.2c0-2.73,2.16-4.91,5.75-4.91c1.48,0,2.83,0.42,3.48,0.65c0.11,0.94,0.26,2.03,0.49,3.67
                        L241.31,132.33z" />
                        <g>
                            <path class="st0" d="M225.87,84.42c0-1.58,1.2-2.78,2.7-2.78c1.51,0,2.71,1.2,2.71,2.78c0,1.59-1.19,2.76-2.71,2.76
                            C227.06,87.18,225.87,86.01,225.87,84.42 M228.57,87.68c1.79,0,3.3-1.38,3.3-3.26c0-1.87-1.51-3.26-3.3-3.26
                            c-1.78,0-3.3,1.39-3.3,3.26C225.27,86.29,226.79,87.68,228.57,87.68 M227.94,84.65h0.61l0.92,1.51h0.59l-0.99-1.54
                            c0.52-0.06,0.9-0.33,0.9-0.96c0-0.69-0.4-0.99-1.23-0.99h-1.33v3.48h0.53V84.65z M227.94,84.2v-1.07h0.72
                            c0.37,0,0.75,0.08,0.75,0.52c0,0.53-0.4,0.55-0.84,0.55H227.94z" />
                            <g>
                                <defs>
                                    <path id="SVGID_1_" d="M58.49,94.19v-0.87c0,0,0.11-0.14,0.39-0.33c0.19-0.13,0.55-0.34,0.82-0.48
                                    c0.61-0.32,1.34-0.54,1.61-0.64c2.02-0.74,3.57-1.02,3.65-1.04c0.11-0.03,2.03-0.35,3.53-0.41h17.12c0,0-0.85-0.52-1.04-0.64
                                    c-0.11-0.06-0.93-0.59-1.85-1.44c-0.77-0.71-1.61-1.64-2.14-2.72c-0.56-1.01-0.87-2.26-0.87-2.26h2.49c0,0,2.29-0.15,4.63-0.75
                                    c2.33-0.61,4.22-0.91,4.57-0.98c0.35-0.07,1.29-0.11,1.33-0.11c0.02-0.01,0.31-0.23,0.55-0.48c0.27-0.27,0.49-0.62,0.49-0.62
                                    s-1.2-2.37-1.62-3.64c-0.42-1.27-1.11-3.85-1.21-5.32c-0.06-0.88-0.08-3.02,0.06-4.51c0.09-1.01,0.4-1.74,0.4-1.74
                                    s0.64,0.47,1.79,0.92c1.16,0.46,3.85,1.32,4.22,1.45c0.38,0.13,2.05,0.58,2.08,0.58c0.04-0.01,0.16-0.05,0.17-0.11
                                    c0.02-0.07,0.22-1.23,0.23-1.39c0.01-0.16,0.07-1.44,0.06-1.56c-0.01-0.12-0.12-1.01-0.17-1.16c-0.06-0.15-0.12-0.29-0.12-0.29
                                    s1.06,0.17,1.62,0.4c0.56,0.23,1.27,0.52,1.27,0.52s-0.15-1.81-0.17-2.02c-0.01-0.05-0.05-0.42-0.12-1.1
                                    c-0.02-0.22-0.04-0.47-0.06-0.75c-0.09-1.26-0.15-3.18-0.04-5.81c0.05-1.16,0.04-2.37,0.16-3.73c0.13-1.57,0.39-3.33,0.7-5.38
                                    c0.41-2.8,1.4-6.73,2.8-10.62c1.03-2.85,2.3-5.65,3.62-8.12c0.79-1.47,1.62-2.94,2.47-4.28c2.16-3.4,4.45-6.22,6.44-8.27
                                    c2.97-3.06,7.2-6.81,12.78-9.72c5.45-2.84,12-4.86,20.24-4.86c7.43,0,14.73,2.08,20.18,4.92c2.83,1.47,5.3,3.17,7.46,4.86
                                    c2.1,1.65,3.86,3.35,5.32,4.86c1.99,2.05,4.31,4.88,6.48,8.27c0.85,1.33,1.7,2.75,2.49,4.22c1.31,2.46,2.5,5.25,3.53,8.1
                                    c1.4,3.9,2.42,7.9,2.83,10.7c0.3,2.05,0.56,3.81,0.69,5.38c0.12,1.36,0.17,2.52,0.21,3.67c0.11,2.64-0.01,4.55-0.1,5.81
                                    c0-0.06-0.35,3.81-0.35,3.81s0.65-0.23,1.21-0.46c0.56-0.23,1.54-0.47,1.56-0.46c0.03,0.01,0.1-0.04,0,0.29
                                    c-0.1,0.33-0.15,0.78-0.17,0.98c-0.03,0.2-0.02,1.33,0,1.56c0.02,0.23,0.16,1.54,0.35,1.68c0.1,0.08,1.23-0.29,1.45-0.35
                                    c0.22-0.06,1.96-0.63,2.66-0.87c0.7-0.24,2.69-0.96,3.01-1.1c0.32-0.14,1.1-0.58,1.1-0.58s0.25,1.08,0.29,1.45
                                    c0.04,0.36,0.17,2.01,0.18,2.2c0,0.18-0.06,2.47-0.12,2.89c-0.06,0.42-0.46,2.74-0.58,3.18c-0.12,0.44-0.55,1.85-1.04,3.01
                                    c-0.49,1.16-1.21,2.49-1.21,2.49l0.92,1.04c0,0,0.84,0.05,0.93,0.06c0.09,0.01,2.77,0.49,3.35,0.64
                                    c0.59,0.15,2.89,0.7,3.53,0.81c0.63,0.11,1.84,0.3,2.43,0.35c0.59,0.05,2.95,0.06,2.95,0.06s-0.58,1.9-1.45,3.18
                                    c-0.74,1.09-1.35,1.62-1.91,2.08c-0.28,0.23-0.52,0.43-0.8,0.64c-0.53,0.37-1.18,0.76-1.5,0.98c-0.14,0.1-0.17,0.17-0.17,0.17
                                    h16.13c0,0,3.52,0.16,5.15,0.58c1.62,0.42,3.71,1.09,4.63,1.5c0.91,0.42,1.33,0.92,1.33,0.92v0.75H58.49z" />
                                </defs>
                                <clipPath id="SVGID_2_">
                                    <use xlink:href="#SVGID_1_" style="overflow:visible;" />
                                </clipPath>
                                <g style="clip-path:url(#SVGID_2_);">
                                    <image style="overflow:visible;" width="1550" height="793" xlink:href="images/logo-head.png" transform="matrix(0.12 0 0 0.12 58.3672 -0.8369)">
                                    </image>
                                </g>
                            </g>
                        </g>
                    </g>
                </svg>`,
});

// ========= header ==============================================================================================================================
Vue.component('header-area', {
    props: ['navbarShow', 'menuBtnActive', 'toggleMobileNavbar', 'hideMobileNavbar', 'bannerData'],
    template: ` <header class="header clearfix">
                    <div class="logo">
                        <a href="https://www.franklin.com.tw/" target="_blank" title="富蘭克林證券投顧">
                            <header-logo></header-logo>
                            <div class="logo-name">
                                富蘭克林．國民的基金
                            </div>
                        </a>
                    </div>
                    <nav class="navbar" :class="{show: navbarShow}">
                        <div class="nav">
                            <a href="https://event.franklin.com.tw/C2019_03_keyword/index.html" target="_blank" title="投資關鍵字" @click="hideMobileNavbar()">
                                <strong>投資關鍵字</strong> <i class="fas fa-star"></i>
                            </a>
                        </div>
                        <div class="nav">
                            <a href="#gift" title="優惠好禮" @click="hideMobileNavbar()">
                                <strong>優惠好禮</strong> <i class="fas fa-star"></i>
                            </a>
                        </div>
                        <div class="nav">
                            <a :href="bannerData.nextLink" :title="bannerData.nextLinkTit" @click="hideMobileNavbar()">
                                <strong>{{bannerData.nextLinkTit}}</strong> <i class="fas fa-star"></i>
                            </a>
                        </div>
                        <div class="nav">
                            <a :href="bannerData.preLink" :title="bannerData.preLinkTit" @click="hideMobileNavbar()">
                                <strong>{{bannerData.preLinkTit}}</strong> <i class="fas fa-star"></i>
                            </a>
                        </div>
                    </nav>
                    <div class="header-bottom">
                        <div class="header-bottom-ctaArea clearfix">
                            <div class="header-bottom-ctaArea-cta">
                                <a href="https://etrade.franklin.com.tw/Open/NewMember" target="_blank" title="免費開戶 領取0.3%優惠">
                                    <strong>免費<br/>開戶</strong>
                                </a>
                            </div>
                            <div class="header-bottom-ctaArea-cta">
                                <a href="https://etrade.franklin.com.tw/Home/Login" target="_blank" title="立即申購">
                                    <strong>立即<br/>申購</strong>
                                </a>
                            </div>
                        </div>
                        <div class="header-bottom-copyright">
                            版權所有富蘭克林證券投顧
                            <br/>FRANKLIN
                            <br/>TEMPLETON INVESTMENTS
                        </div>
                    </div>

                    <div class="menuBtn" data-wow-delay="0.8s" :class="{active: menuBtnActive}" @click="toggleMobileNavbar()">
                        <span></span>
                        <span></span>
                        <span></span>
                        <span></span>
                        <span></span>
                    </div>
                </header>`,
});

// ========= banner ==============================================================================================================================
Vue.component('banner-area', {
    props: ['bannerData'],
    template: ` <section class="banner" :class="bannerData.no">
                    <img :src="bannerData.bannerRight" alt="" class="banner-right">
                    <div class="banner-tit">
                        <div class="banner-infoShadow"></div>
                        <img src="images/banner-tit-star.png" alt="" class="banner-tit-star">
                        <img :src="bannerData.bannerTitImg" :alt="bannerData.bannerTit" class="banner-tit-text">
                        <h1 class="banner-tit-info" :title="bannerData.bannerTit">
                            <div class="banner-tit-info-stit">
                                {{bannerData.bannerSTit}}
                            </div>
                            <div class="banner-tit-info-tit">
                                {{bannerData.bannerTit}}
                            </div>
                        </h1>
                    </div>
                    <div class="banner-man">
                        <div class="banner-infoShadow"></div>
                        <img :src="bannerData.manImg" alt="">
                    </div>
                    <div class="banner-accessories">
                        <div class="banner-infoShadow"></div>
                        <img :src="bannerData.accessoriesImg" alt="">
                    </div>
                    <div class="banner-arrow-area clearfix">
                        <div class="banner-arrow">
                            <a :href="bannerData.preLink" :title="bannerData.preLinkTit">
                                <i class="fas fa-angle-left"></i>
                            </a>
                        </div>
                        <div class="banner-arrow">
                            <a :href="bannerData.nextLink" :title="bannerData.nextLinkTit">
                                <i class="fas fa-angle-right"></i>
                            </a>
                        </div>
                    </div>
                </section>`,
});

// ========= 投資關鍵字 ==============================================================================================================================
Vue.component('keyword-area', {
    props: ['keywordData'],
    template: ` <section class="item keyword" id="keyword">
                    <div class="keyword-info-1">
                        <div class="container-2">
                            <h2 class="tit-type1 wow fadeInUp" :title="keywordData.itemTit">
                                <div class="tit-type1-tit">
                                    <div class="tit-type1-left"></div>
                                    <div class="tit-type1-right"></div>
                                    <div class="tit-type1-tit-info">
                                        {{keywordData.itemTit}}
                                    </div>
                                </div>
                            </h2>
                            <div class="item-text wow fadeInUp">
                                <strong v-html="keywordData.itemText"></strong>
                            </div>
                        </div>
                    </div>
                    <div class="keyword-info-2 clearfix">
                        <div class="keyword-info-2-left wow fadeInUp">
                            <img :src="keywordData.itemImg" alt="">
                        </div>
                        <div class="keyword-info-2-right wow fadeInRight">
                            <h3 class="keyword-info-2-right-tit" :title="keywordData.item2Tit">
                                <i class="fas fa-star"></i>
                                <div>
                                    {{keywordData.item2Tit}}
                                </div>
                            </h3>
                            <div class="keyword-info-2-right-text">
                                {{keywordData.item2Text}}
                            </div>
                        </div>
                    </div>
                    <div class="keyword-info-3">
                        <div class="container-2">
                            <h3 class="tit-type2 wow fadeInUp" :title="keywordData.item3Tit">
                                {{keywordData.item3Tit}}
                            </h3>
                            <div class="item-text alginCenter wow fadeInUp" v-html="keywordData.item3Text"></div>
                            <div class="btnArea">
                                <div class="btn wow fadeInUp">
                                    <a href="https://event.franklin.com.tw/C2019_03_keyword/index.html" target="_blank" title="立即票選投資關鍵字">
                                        <strong>立即票選投資關鍵字</strong> <i class="fas fa-caret-right"></i>
                                    </a>
                                </div>
                                <div class="btn type2 wow fadeInUp" data-wow-delay="0.3s">
                                    <a href="https://event.franklin.com.tw/award/index.html" target="_blank" title="富蘭克林得獎全紀錄">
                                        <strong>富蘭克林得獎全紀錄</strong> <i class="fas fa-caret-right"></i>
                                    </a>
                                </div>
                            </div>
                        </div>
                    </div>
                </section>`,
});

// ========= 好禮項目 ==============================================================================================================================
Vue.component('gift-item', {
    props: ['giftItemData'],
    template: ` <div class="gift-item wow fadeIn">
                    <div class="gift-item-bg">
                        <div class="gift-item-img">
                            <img :src="giftItemData.img" :alt="giftItemData.imgAlt">
                        </div>
                        <h3 class="gift-item-tit wow fadeInUp" :title="giftItemData.tit">
                            {{giftItemData.tit}}
                        </h3>
                        <div class="gift-item-text wow fadeInUp" v-html="giftItemData.text"></div>
                        <div class="btnArea">
                            <div class="btn type3 wow fadeInUp">
                                <a href="https://etrade.franklin.com.tw/Open/NewMember" target="_blank" title="立即開戶">
                                    <strong>立即開戶</strong> <i class="fas fa-caret-right"></i>
                                </a>
                            </div>
                            <div class="btn type2 wow fadeInUp" data-wow-delay="0.3s">
                                <a href="https://etrade.franklin.com.tw/Home/Login" target="_blank" title="立即下單">
                                    <strong>立即下單</strong> <i class="fas fa-caret-right"></i>
                                </a>
                            </div>
                        </div>
                        <div class="gift-item-time wow fadeInUp">活動期間：{{giftItemData.time}}</div>
                    </div>
                </div>`,
});

// ========= 優惠好禮 ==============================================================================================================================
Vue.component('gift-area', {
    props: ['giftItemData'],
    template: ` <section class="item gift" id="gift">
                    <div class="container-2">
                        <h2 class="tit-type1 wow fadeInUp" title="優惠好禮一次送給你">
                            <div class="tit-type1-tit">
                                <div class="tit-type1-left"></div>
                                <div class="tit-type1-right"></div>
                                <div class="tit-type1-tit-info">
                                    優惠好禮一次送給你
                                </div>
                            </div>
                        </h2>
                        <div class="gift-item-tab clearfix">
                            <div class="active">
                                <strong>得獎</strong>禮
                            </div>
                            <div>
                                <strong>加碼</strong>禮
                            </div>
                            <div>
                                <strong>新年</strong>禮
                            </div>
                            <div>
                                <strong>精選</strong>禮
                            </div>
                            <div>
                                <strong>見面</strong>禮
                            </div>
                            <div>
                                <strong>首購</strong>禮
                            </div>
                        </div>
                        <div class="gift-item-area">
                            <gift-item v-for="item in giftItemData" v-bind:key="item.id" :gift-item-data="giftItemData[item.id]"></gift-item>
                        </div>
                    </div>
                </section>`,
});

// ========= 注意事項 ==============================================================================================================================
Vue.component('notice-area', {
    template: ` <section class="notice">
                    <div class="container-2">
                        <h2 title="注意事項" class="tit-type2 wow fadeInUp">
                            注意事項
                        </h2>
                        <div class="notice-item wow fadeInUp">
                            <h3 class="notice-item-tit" title="活動期間">
                                活動期間
                            </h3>
                            <div class="notice-item-text">
                                <strong>得獎禮 / 加碼禮：</strong>2019年3月4日~2019年5月1日
                                <br/>
                                <strong>新年禮 / 精選禮 / 見面禮 / 首購禮：</strong>2019年1月1日~2019年3月31日
                            </div>
                        </div>
                        <div class="dividingLine"></div>
                        <div class="notice-item wow fadeInUp">
                            <h3 class="notice-item-tit" title="活動規則">
                                活動規則
                            </h3>
                            <div class="notice-item-text">
                                <ol>
                                    <li>
                                        <strong>得獎禮：</strong>於活動期間申購得獎系列基金，每檔基金各可用1筆1折申購手續費優惠下單，不限交易方式，同一檔基金各股份類別擇一檔使用。
                                    </li>
                                    <li>
                                        <strong>加碼禮：</strong>於活動期間參加<a href="https://event.franklin.com.tw/C2019_03_keyword/index.html" target="_blank" title="投資關鍵字">「投資關鍵字」<i class="fas fa-link"></i> </a>活動並留下完整資料，可得1筆單筆1折申購手續費優惠(每人限得一次)，若資料留存不完整將無法保留本活動優惠資格，取得優惠不限基金均可申購，優惠下單期間為2019/3/4~2019/6/2。
                                    </li>
                                    <li>
                                        <strong>新年禮：</strong>國民e帳戶全系列基金申購手續費享3折；不限交易方式、交易次數、金額與幣別。
                                    </li>
                                    <li>
                                        <strong>精選禮：</strong>申購
                                        <a href="https://www.franklin.com.tw/ReservationAccount/ECOffer#table" target="_blank" title="第一季精選基金" class="featuredLink-pc">
                                            第一季精選基金 <i class="fas fa-link"></i>
                                        </a>
                                        <a href="https://www.franklin.com.tw/Mobile/Activity/ActivityOffer#table" target="_blank" title="第一季精選基金" class="featuredLink-mobile">
                                            第一季精選基金 <i class="fas fa-link"></i>
                                        </a>
                                        手續費享0.3%優惠；不限交易方式、交易次數、金額與幣別。
                                    </li>
                                    <li>
                                        <strong>見面禮：</strong>活動期間完成國民e帳戶開戶並送件成功，即享1筆定期定額手續費0.3%終身優惠；優惠使用期限至2019/4/30(含假日)，不限基金與下單金額。
                                    </li>
                                    <li>
                                        <strong>首購禮：</strong>於活動期間首次於國民e帳戶下單且扣款成功，即得紅利點數3000點；紅利點數1點折抵新台幣手續費1元，使用期限為一年。
                                        <a href="https://www.franklin.com.tw/ReservationAccount/ECFAQ" target="_blank" title="紅利點數使用問與答">
                                            (紅利點數使用問與答) <i class="fas fa-link"></i>
                                        </a>
                                    </li>
                                </ol>
                                <ul>
                                    <li>
                                        所有活動優惠限新申購適用，已贖回、轉申購、已成立或扣款之定期定額、天天自由扣契約與AI智能理財專區下單者不適用。
                                    </li>
                                    <li>
                                        各項活動取得的優惠與紅利點數僅限「國民e帳戶」網路交易使用，尚未辦理「國民e帳戶」開戶者，需完成開戶、核印，並於活動期間內下單方適用本活動各項優惠。
                                    </li>
                                    <li>
                                        本公司保留是否接受預約開戶，以及取消、中止、修改活動內容、規則、時間或暫停所有活動權利；活動規定需依各活動通知以及富蘭克林基金理財網公告為準。
                                    </li>
                                </ul>
                            </div>
                        </div>
                    </div>
                </section>`,
});

// ========= 燈箱 ==============================================================================================================================
Vue.component('light-box', {
    data: function () {
        return {
            toggle: false,
            isFixedHeight: false,
        }
    },
    template: `<transition>
                    <div class="lightBox" v-show="toggle">
                        <div class="lightBox-bg"></div>
                        <div class="lightBox-container" :class="{fixedHeight: isFixedHeight}" ref="lightBoxContainer" id="lightBoxContainer">
                            <div>
                                <div class="lightBox-close closeBtn">
                                    <i class="fa fa-times" aria-hidden="true"></i>
                                </div>
                                <slot name="infoArea"></slot>
                            </div>
                        </div>
                    </div>
                </transition>`,
    methods: {
        closeLightBox() {
            this.toggle = false;
        }
    },
});

// ========= 精選基金 ==============================================================================================================================
Vue.component('product-list', {
    props: ['product'],
    template: ` <div class="productList-item">
                    <a :href="product.link" target="_blank" :title="product.linkTitle">
                        <div class="productName">
                            {{ product.tit }}<strong v-if="(product.remark) != ''">{{ product.remark }}</strong>
                        </div>
                        <div class="productList-item-arrow">
                            <div></div>
                            <div></div>
                        </div>
                    </a>
                </div>`,
});

// ========= 商品燈箱 ==============================================================================================================================
Vue.component('product-lightbox', {
    props: ['product1', 'product2'],
    template: ` <div>
                    <light-box class="lightBox-1">
                        <slot slot="infoArea">
                            <div class="productList productList-1">
                                <h2 title="富蘭克林第一季精選基金" class="tit-type1">
                                    <div class="tit-type1-tit">
                                        <div class="tit-type1-left"></div>
                                        <div class="tit-type1-right"></div>
                                        <div class="tit-type1-tit-info">
                                            富蘭克林第一季精選基金
                                        </div>
                                    </div>
                                </h2>
                                <div class="productList-item-area">
                                    <product-list v-for="n in product1" v-bind:key="n.id" :product="product1[n.id]"></product-list>
                                </div>
                                <div class="btnArea">
                                    <div class="btn">
                                        <a href="https://etrade.franklin.com.tw/Open/NewMember" title="立即開戶">
                                            <strong>立即開戶</strong> <i class="fas fa-caret-right"></i>
                                        </a>
                                    </div>
                                    <div class="btn type2">
                                        <a href="https://etrade.franklin.com.tw/Home/Login" target="_blank" title="立即下單">
                                            <strong>立即下單</strong> <i class="fas fa-caret-right"></i>
                                        </a>
                                    </div>
                                </div>
                            </div>
                        </slot>
                    </light-box>

                    <light-box class="lightBox-2">
                        <slot slot="infoArea">
                            <div class="productList productList-2">
                                <h2 title="富蘭克林2019在台獲獎基金" class="tit-type1">
                                    <div class="tit-type1-tit">
                                        <div class="tit-type1-left"></div>
                                        <div class="tit-type1-right"></div>
                                        <div class="tit-type1-tit-info">
                                            富蘭克林2019在台獲獎基金
                                        </div>
                                    </div>
                                </h2>
                                <div class="productList-item-area">
                                    <product-list v-for="n in product2" v-bind:key="n.id" :product="product2[n.id]"></product-list>
                                </div>
                                <div class="btnArea">
                                    <div class="btn">
                                        <a href="https://etrade.franklin.com.tw/Open/NewMember" title="立即開戶">
                                            <strong>立即開戶</strong> <i class="fas fa-caret-right"></i>
                                        </a>
                                    </div>
                                    <div class="btn type2">
                                        <a href="https://etrade.franklin.com.tw/Home/Login" target="_blank" title="立即下單">
                                            <strong>立即下單</strong> <i class="fas fa-caret-right"></i>
                                        </a>
                                    </div>
                                </div>
                            </div>
                        </slot>
                    </light-box>
                </div>`,
});

var content = new Vue({
    el: '#content',
    data: {
        name: '富蘭克林證券投顧',
        screenWidth: document.body.clientWidth,
        windowWidth: 0,
        windowHeight: 0,
        menuBtnActive: false,
        navbarShow: false,
        bannerData: [
            {
                no: 'banner-1',
                bannerRight: 'images/1-banner-right.png',
                bannerTitImg: 'images/1-banner-tit.svg',
                bannerSTit: '不知如何選基金？',
                bannerTit: '入門指標在這裡！',
                manImg: 'images/1-banner-man.svg',
                accessoriesImg: 'images/1-banner-accessories.svg',
                preLink: 'index3.html',
                preLinkTit: '看20年贏家如何挑選！',
                nextLink: 'index2.html',
                nextLinkTit: '看行家是如何選股擇債',
            },
            {
                no: 'banner-2',
                bannerRight: 'images/2-banner-right.png',
                bannerTitImg: 'images/2-banner-tit.svg',
                bannerSTit: '買基金有選擇障礙？',
                bannerTit: '先看行家是如何選股擇債',
                manImg: 'images/2-banner-man.svg',
                accessoriesImg: 'images/2-banner-accessories.svg',
                preLink: 'index.html',
                preLinkTit: '入門指標在這裡！',
                nextLink: 'index3.html',
                nextLinkTit: '看20年贏家如何挑選！',
            },
            {
                no: 'banner-3',
                bannerRight: 'images/3-banner-right.png',
                bannerTitImg: 'images/3-banner-tit.svg',
                bannerSTit: '找不到適合的基金？',
                bannerTit: '看20年贏家如何挑選！',
                manImg: 'images/3-banner-man.svg',
                accessoriesImg: 'images/3-banner-accessories.svg',
                preLink: 'index2.html',
                preLinkTit: '看行家是如何選股擇債',
                nextLink: 'index.html',
                nextLinkTit: '入門指標在這裡！',
            }
        ],
        keywordData: [
            {
                itemTit: '基金獎：投資基金的入門指標！',
                itemText: '吃美食鎖定米其林、看電影要選得獎片，買基金當然要參考基金獎的獲獎基金！',
                itemImg: `images/1-item-2-img.png`,
                item2Tit: `嚴謹的評選機制 投資新手的重要參考`,
                item2Text: `如同奧斯卡、金馬獎的評審會依據不同評分標準，選出當年度的得獎影片。台灣年度五大基金獎，專家評審按照各項評鑑指標，參考基金表現、市場趨勢和風險管理能力，選出優質的基金和團隊！`,
                item3Tit: `20年的基金贏家 投資道路上與您同行`,
                item3Text: `在競爭激烈的「茫茫基海」之中，富蘭克林創下連續20年獲獎，總得獎數超過200座的傲人紀錄，印證全方位資產管理專家的美名。
                            <br/><br/>
                            為了和投資人分享獲獎喜悅，2019/5/1前於「富蘭克林國民e帳戶」<strong class="focus">申購得獎基金</strong>，享有<strong class="focus">1筆1折手續費申購優惠</strong>，不限交易方式外，只要<strong class="focus">參加「投資關鍵字」</strong>的活動，可獲得富蘭克林旗下不限基金1筆單筆申購<strong class="focus"> 1折的手續費優惠</strong>，助投資朋友打造攻守兼備的投資組合！`,
            },
            {
                itemTit: '大放異彩，來自用心鑽研的堅持',
                itemText: '要創造舉世無雙的完美工藝，來自匠人的全心付出；要得到各大基金獎的讚揚與推崇，<br/>更需來自職人用心研究市場、 細心選股擇債的堅持！ ',
                itemImg: `images/2-item-2-img.png`,
                item2Tit: `專家領航 富蘭克林穩坐全球投資專家`,
                item2Text: `富蘭克林基金投資團隊，以嚴謹的分析法則、專業的篩選機制，提供投資人符合市場現況、因應理財需求的基金產品。全方位的理財服務獲得國內外基金獎評審的高度肯定，更創下在台連續20年獲獎，得獎超過200座的傲人成就！`,
                item3Tit: `20年的基金贏家 投資道路上與您同行`,
                item3Text: `為了和投資人分享獲獎喜悅，2019/5/1前於「富蘭克林國民e帳戶」<strong class="focus">申購得獎基金</strong>，享有<strong class="focus">1筆1折手續費申購優惠</strong>，不限交易方式外，只要<strong class="focus">參加「投資關鍵字」</strong>的活動，可獲得富蘭克林旗下不限基金1筆單筆申購<strong class="focus"> 1折的手續費優惠</strong>，助投資朋友打造攻守兼備的投資組合！`,
            },
            {
                itemTit: '20年贏家的秘密',
                itemText: '惟有身懷絕技，才能在江湖屹立不搖20年！富蘭克林能在各大基金獎連續風光20載，<br/>專業投資團隊和嚴謹市場分析， 是成就榮耀的重要基石。',
                itemImg: `images/3-item-2-img.png`,
                item2Tit: `無論市場陰晴變化 秉持初心與專業`,
                item2Text: `無論市場行情大好、或者震盪加劇，富蘭克林始終秉持初心，提供專業的投資建議和理財服務，因而獲得各大基金獎的讚揚與推崇，在台締造連續20年獲獎，超過200座大獎的殊榮，是令人矚目的得獎常勝軍！`,
                item3Tit: `20年的基金贏家 投資道路上與您同行`,
                item3Text: `為了和投資人分享獲獎喜悅，2019/5/1前於「富蘭克林國民e帳戶」<strong class="focus">申購得獎基金</strong>，享有<strong class="focus">1筆1折手續費申購優惠</strong>，不限交易方式外，只要<strong class="focus">參加「投資關鍵字」</strong>的活動，可獲得富蘭克林旗下不限基金1筆單筆申購<strong class="focus"> 1折的手續費優惠</strong>，助投資朋友打造攻守兼備的投資組合！`,
            },
        ],
        giftItemData: [
            {
                id: 0,
                img: `images/tours-05.png`,
                imgAlt: `得獎禮`,
                tit: `得獎系列基金1折優惠`,
                text: `於活動期間申購<strong class="focus openLightBox openLightBox-2">《富蘭克林2019得獎系列基金》 <i class="fas fa-external-link-alt"></i></strong>，每檔基金各享1筆1折手續費申購優惠，不限交易方式，快把握機會，打造與獎同行的投資組合吧！`,
                time: `2019年3月4日~2019年5月1日`,
            },
            {
                id: 1,
                img: `images/tours-06.png`,
                imgAlt: `加碼禮`,
                tit: `投資關鍵字驚喜優惠`,
                text: `於活動期間參加<a href="https://event.franklin.com.tw/C2019_03_keyword/index.html" target="_blank" title="《投資關鍵字》"><strong class="focus openLightBox">《投資關鍵字》<i class="fas fa-link"></i></strong></a> 的活動，可獲得1筆單筆1折申購手續費優惠，不限基金，優惠使用期限至2019/6/2(含假日)，助您打造攻守兼備的夢幻投組！`,
                time: `2019年3月4日~2019年5月1日`,
            },
            {
                id: 2,
                img: `images/tours-01.jpg`,
                imgAlt: `新年禮`,
                tit: `全館三折優惠`,
                text: `於活動期間申購富蘭克林旗下任一基金，均享有三折的手續費申購優惠(註)，快來領取優惠，打造專屬的投資方程式！
                        <div class="gift-item-text-remark">
                            註：精選基金另享有0.3%申購優惠喔！
                        </div>`,
                time: `2019年1月1日~2019年3月31日`,
            },
            {
                id: 3,
                img: `images/tours-02.jpg`,
                imgAlt: `精選禮`,
                tit: `精選基金0.3%`,
                text: `於活動期間申購<strong class="focus openLightBox openLightBox-1">第一季精選基金 <i class="fas fa-external-link-alt"></i></strong>，無論單筆、天天自由扣、定期定額皆享有0.3%手續費申購優惠，快把握時機，為手中資產打造新風貌！`,
                time: `2019年1月1日~2019年3月31日`,
            },
            {
                id: 4,
                img: `images/tours-03.jpg`,
                imgAlt: `見面禮`,
                tit: `開戶限時優惠`,
                text: `活動期間完成國民e帳戶開戶並送件成功，即享1筆定期定額手續費0.3%終身優惠；優惠使用期限至2019/4/30(含假日)，不限基金與下單金額。`,
                time: `2019年1月1日~2019年3月31日`,
            },
            {
                id: 5,
                img: `images/tours-04.jpg`,
                imgAlt: `首購禮`,
                tit: `紅利點數3000點`,
                text: `凡於國民e帳戶成功開戶後，首次下單申購並扣款成功即贈送紅利點數3,000點，祝您在往後投資的道路，有更多的優惠隨行。
                        <div class="gift-item-text-remark">
                            註：紅利1點可折抵新台幣1元(適用單筆或天天自由扣申購手續費)
                        </div>`,
                time: `2019年1月1日~2019年3月31日`,
            },
            
        ],
        product1: [
            {
                id: 0,
                link: `https://event.franklin.com.tw/C2017_04_Q2/index.html`,
                linkTitle: `新興國家固定收益基金(本基金有相當比重投資於非投資等級之高風險債券且基金之配息來源可能為本金)`,
                tit: `新興國家固定收益基金`,
                remark: `(本基金有相當比重投資於非投資等級之高風險債券且基金之配息來源可能為本金)`,
            },
            {
                id: 1,
                link: `https://event.franklin.com.tw/C2017_11_Q4_0810/index.html`,
                linkTitle: `全球債券基金(本基金之配息來源可能為本金)`,
                tit: `全球債券基金`,
                remark: `(本基金之配息來源可能為本金)`,
            },
            {
                id: 2,
                link: `https://event.franklin.com.tw/C2017_08_Q3_0839/index.html`,
                linkTitle: `穩定月收益基金(本基金有相當比重投資於非投資等級之高風險債券且基金之配息來源可能為本金)`,
                tit: `穩定月收益基金`,
                remark: `(本基金有相當比重投資於非投資等級之高風險債券且基金之配息來源可能為本金)`,
            },
            {
                id: 3,
                link: `https://event.franklin.com.tw/C2018_10_fund/0427.html`,
                linkTitle: `精選收益基金(本基金有相當比重投資於非投資等級之高風險債券且基金之配息來源可能為本金)`,
                tit: `精選收益基金`,
                remark: `(本基金有相當比重投資於非投資等級之高風險債券且基金之配息來源可能為本金)`,
            },
            {
                id: 4,
                link: `https://event.franklin.com.tw/C2018_10_Q4_1641/index.html`,
                linkTitle: `多空策略基金`,
                tit: `多空策略基金`,
                remark: ``,
            },
            {
                id: 5,
                link: `https://event.franklin.com.tw/C2018_12_fund/1107.html`,
                linkTitle: `富蘭克林公用事業基金(本基金之配息來源可能為本金)`,
                tit: `富蘭克林公用事業基金`,
                remark: `(本基金之配息來源可能為本金)`,
            },
            {
                id: 6,
                link: `https://event.franklin.com.tw/C2017_07_Q3_101/index.html`,
                linkTitle: `坦伯頓成長基金(本基金之配息來源可能為本金)`,
                tit: `坦伯頓成長基金`,
                remark: `(本基金之配息來源可能為本金)`,
            },
            {
                id: 7,
                link: `https://event.franklin.com.tw/C2017_06_Q3_1009/index.html`,
                linkTitle: `亞洲小型企業基金`,
                tit: `亞洲小型企業基金`,
                remark: ``,
            },
            {
                id: 8,
                link: `https://event.franklin.com.tw/C2018_12_Q4_0799/index.html`,
                linkTitle: `美國機會基金`,
                tit: `美國機會基金`,
                remark: ``,
            },
        ],
        product2: [
            {
                id: 0,
                link: `https://event.franklin.com.tw/C2017_06_Q3_1009/index.html`,
                linkTitle: `富蘭克林坦伯頓亞洲小型企業基金`,
                tit: `富蘭克林坦伯頓亞洲小型企業基金`,
                remark: ``,
            },
            {
                id: 1,
                link: `https://www.franklin.com.tw/Fund/BasicInformation/0830`,
                linkTitle: `富蘭克林坦伯頓泰國基金`,
                tit: `富蘭克林坦伯頓泰國基金`,
                remark: ``,
            },
            {
                id: 2,
                link: `https://www.franklin.com.tw/Fund/BasicInformation/108`,
                linkTitle: `富蘭克林高科技基金(本基金之配息來源可能為本金)`,
                tit: `富蘭克林高科技基金`,
                remark: `(本基金之配息來源可能為本金)`,
            },
            {
                id: 3,
                link: `https://www.franklin.com.tw/Fund/BasicInformation/1000`,
                linkTitle: `富蘭克林坦伯頓吉富世界基金`,
                tit: `富蘭克林坦伯頓吉富世界基金`,
                remark: ``,
            },
            {
                id: 4,
                link: `https://event.franklin.com.tw/C2018_12_fund/1107.html`,
                linkTitle: `富蘭克林公用事業基金(本基金之配息來源可能為本金)`,
                tit: `富蘭克林公用事業基金`,
                remark: `(本基金之配息來源可能為本金)`,
            }
        ],
    },
    mounted() {
        this.$nextTick(() => {
            //-------------------------------------signature
            console.log('%cMade by Captain%c2019/01',
                        'color: #fff; border-radius: 5px; background: #1a4f9c; padding: 2px 10px; font-weight: bold;',
                        'color: #000; border-radius: 5px; background: #ffde00; padding: 2px 10px; margin: 0px 5px;');
                        
            var win_W = $(window).width();                                      // 螢幕寬度
            var win_H = $(window).innerHeight();                                // 螢幕高度
            var win_Scroll = $(window).scrollTop();                             // 捲軸位置
            var thisPath = location.protocol + '//' +location.host;             // 網域
            var n;

            $(window).resize(function (e) {
                win_W = $(window).width();
                win_Scroll = $(window).scrollTop();
            });

            $(window).scroll(function(){
                win_Scroll = $(window).scrollTop();
            });

            //-------------------------------------WOW
            new WOW().init();

            //-------------------------------------資安用  target="_blank" 加 rel="nofollow me noopener noreferrer"
            function addNoOpener() {
                var _linkHasTargetBlank = $('a[target="_blank"]');
                for (n = 0; n < _linkHasTargetBlank.length; n++) {
                    // 如果要連的網址跟這網站網域不同  加[rel="nofollow me noopener noreferrer"]
                    _linkHasTargetBlank.eq(n).attr('href').indexOf(thisPath) ? _linkHasTargetBlank.eq(n).attr('rel', 'nofollow me noopener noreferrer') : '';
                };
            }
            addNoOpener();

            //-------------------------------------浮動式top鍵
            $(window).bind('scroll resize', function () {
                var $this = $(this);
                var $this_Top = $this.scrollTop();

                //當高度小於100時，關閉區塊 
                if ($this_Top < 100) {
                    $('.topBtn').stop().animate({
                        bottom: "-70px"
                    });
                }
                if ($this_Top > 100) {
                    $('.topBtn').stop().animate({
                        bottom: "70px"
                    });
                }
            }).scroll();

            //-------------------------------------錨點平滑滾動效果
            $('a[href*=#]').click(function () {
                if (location.pathname.replace(/^\//, '') == this.pathname.replace(/^\//, '') && location.hostname == this.hostname) {
                    var $target = $(this.hash);
                    $target = $target.length && $target || $('[name=' + this.hash.slice(1) + ']');
                    if ($target.length) {
                        var targetOffset = $target.offset().top;
                        $('html,body').animate({
                                scrollTop: targetOffset-90
                            },
                            1000);
                        return false;
                    }
                }
            });

            //-------------------------------------導航列
            var _itemName = $('.item'); // 區塊class name
            var _itemPos = [];
            var _itemLength = _itemName.length;
            var _itemPosCut = 10; // 要減掉的高度

            function navIcon() {
                for (n = 0; n < _itemLength; n++) {
                    _itemPos[n] = _itemName.eq(n).offset().top;
                };
                for (n = 0; n < _itemLength; n++) {
                    if (win_Scroll >= (_itemPos[n] - _itemPosCut)) {
                        $('.nav').eq(n).addClass('active').siblings().removeClass('active');
                    }
                    if (win_Scroll < (_itemPos[0] - _itemPosCut)) {
                        $('.nav').removeClass('active');
                    };
                };
            }
            $(window).scroll(function () {
                navIcon();
            });

            //-------------------------------------好禮等高
            this.sameHeight();
            $(window).resize(()=>{
                this.sameHeight();
            });
            
            //-------------------------------------好禮切換
            let giftTabIndex;
            $('.gift-item').eq(0).addClass('show');
            $('.gift-item-tab div').click(function(){
                $(this).addClass('active').siblings().removeClass('active');
                giftTabIndex = $(this).index();
                $('.gift-item').eq(giftTabIndex).addClass('show').siblings().removeClass('show');
                $('html,body').scrollTop(win_Scroll-1);
                $('html,body').scrollTop(win_Scroll + 1);
            });

            //-------------------------------------燈箱
            $('.lightBox-close, .lightBox-bg').click(()=>{
                $('.lightBox').fadeOut();
            });
            $('.openLightBox-1').click(()=>{
                $('.lightBox-1').fadeIn();
                this.sameHeight2();
            });
            $('.openLightBox-2').click(() => {
                $('.lightBox-2').fadeIn();
                this.sameHeight3();
            });

            //-------------------------------------基金列表
            this.sameHeight2();
            this.sameHeight3();
            $(window).resize(() => {
                this.sameHeight2();
                this.sameHeight3();
            });

        })
    },
    methods: {
        toggleMobileNavbar() {
            this.menuBtnActive === false ? this.menuBtnActive = true : this.menuBtnActive = false;
            this.navbarShow === false ? this.navbarShow = true : this.navbarShow = false;
        },
        hideMobileNavbar() {
            this.menuBtnActive = false
            this.navbarShow = false
        },
        sameHeight() {
            let item = $('.gift-item-text');
            item.removeAttr('style');

            let giftItemHeight = [];
            for (let n = 0; n < 6; n++) {
                giftItemHeight[n] = item.eq(n).innerHeight();
            };
            let height = Math.max.apply(null, giftItemHeight);
            item.css('height', height);
        },
        sameHeight2() {
            let item = $('.productList-1 .productList-item a');
            item.removeAttr('style');

            let giftItemHeight = [];
            for (let n = 0; n < 4; n++) {
                giftItemHeight[n] = item.eq(n).innerHeight();
            };
            let height = Math.max.apply(null, giftItemHeight);
            item.css('height', height);
        },
        sameHeight3() {
            let item = $('.productList-2 .productList-item a');
            item.removeAttr('style');

            let giftItemHeight = [];
            for (let n = 0; n < 4; n++) {
                giftItemHeight[n] = item.eq(n).innerHeight();
            };
            let height = Math.max.apply(null, giftItemHeight);
            item.css('height', height);
        },
    },
    watch: {
        screenWidth(val) {
            this.screenWidth = val
        },
    },
});